
Функция ПолучитьПредметПонаименованиюИзХоли(ИмяПредмета) Экспорт
	Если  ИмяПредмета = "Разработка WEB" Тогда
		Возврат Справочники.Предметы.НайтиПоКоду("IT-000004")
	ИначеЕсли  ИмяПредмета = "Физика" Тогда
		Возврат Справочники.Предметы.НайтиПоКоду("CT-000010");
	ИначеЕсли  ИмяПредмета = "Математика" Тогда
		Возврат Справочники.Предметы.НайтиПоКоду("CT-000007");
	ИначеЕсли  ИмяПредмета = "Английский язык" Тогда
		Возврат Справочники.Предметы.НайтиПоКоду("CT-000002");	
	ИначеЕсли  ИмяПредмета = "Биология" Тогда
		Возврат Справочники.Предметы.НайтиПоКоду("CT-000004");
	ИначеЕсли  ИмяПредмета = "Химия" Тогда
		Возврат Справочники.Предметы.НайтиПоКоду("CT-000012");
	ИначеЕсли  ИмяПредмета = "Белорусский язык" Тогда
		Возврат Справочники.Предметы.НайтиПоКоду("CT-000003");
	ИначеЕсли  ИмяПредмета = "Всемирная история" Тогда
		Возврат Справочники.Предметы.НайтиПоКоду("CT-000005");
	ИначеЕсли  ИмяПредмета = "История Беларуси" Тогда
		Возврат Справочники.Предметы.НайтиПоКоду("CT-000006");
	ИначеЕсли  ИмяПредмета = "Обществоведение" Тогда
		Возврат Справочники.Предметы.НайтиПоКоду("CT-000008");
	ИначеЕсли  ИмяПредмета = "Русский язык" Тогда
		Возврат Справочники.Предметы.НайтиПоКоду("CT-000009");	
	ИначеЕсли  ИмяПредмета = "Французский язык" Тогда
		Возврат Справочники.Предметы.НайтиПоКоду("CT-000011");	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ИмяПредмета);
		Возврат Справочники.Предметы.ПустаяСсылка();
	КонецЕсли
	
	
КонецФункции