#Область ОбработчикиСобытийФормы

&НаСервере
Процедура УЦ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура УЦ_ПослеЗаписиПосле(ПараметрыЗаписи)
	ОбновитьЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УЦ_УЦ_УслугиЗаПериодПриИзмененииВместо(Элемент)
	Объект.УЦ_ДатаНачала = ЭтотОбъект.УЦ_УслугиЗаПериод.ДатаНачала;
	Объект.УЦ_ДатаОкончания = ЭтотОбъект.УЦ_УслугиЗаПериод.ДатаОкончания;
КонецПроцедуры

&НаСервере
Процедура УЦ_УчебнаяГруппаПриИзмененииПослеНаСервере()
	Если Не ЗначениеЗаполнено(Объект.УЦ_ДатаНачала) Тогда
		Объект.УЦ_ДатаНачала = НачалоМесяца(Объект.Дата);
		Объект.УЦ_ДатаОкончания = КонецМесяца(Объект.Дата);
		ОбновитьЭлементыФормы();
	КонецЕсли;
	Объект.УЦ_КоличествоЗанятий 
		= УчебныеГруппыСервер.ПолучитьКоличествоЗанятийЗаПериод(
			Объект.УЦ_УчебнаяГруппа,
			Объект.УЦ_ДатаНачала,
			Объект.УЦ_ДатаОкончания);
			
КонецПроцедуры

&НаКлиенте
Процедура УЦ_УчебнаяГруппаПриИзмененииПосле(Элемент)
	УЦ_УчебнаяГруппаПриИзмененииПослеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЭлементыФормы();
	
	// Период
	УЦ_УслугиЗаПериод.ДатаНачала = Объект.УЦ_ДатаНачала;
	УЦ_УслугиЗаПериод.ДатаОкончания = Объект.УЦ_ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура УЦ_ЗаполнитьПоГруппеПослеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура УЦ_ЗаполнитьПоГруппеПосле(Команда)
	УЦ_ЗаполнитьПоГруппеПослеНаСервере();
КонецПроцедуры

#КонецОбласти